hansfbaier/mecrisp-quintus/gd32vf103cb/svd-registers/gd32vf103.svd-cleaned.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBG</name>
      <description>Debug support</description>
      <groupName>DBG</groupName>
      <baseAddress>0xE0042000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ID</name>
          <displayName>ID</displayName>
          <description>ID code register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID_CODE</name>
              <description>DBG ID code register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control register 0</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLP_HOLD</name>
              <description>Sleep mode hold register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSLP_HOLD</name>
              <description>Deep-sleep mode hold register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STB_HOLD</name>
              <description>Standby mode hold register</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWDGT_HOLD</name>
              <description>FWDGT hold bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDGT_HOLD</name>
              <description>WWDGT hold bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0_HOLD</name>
              <description>TIMER 0 hold bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER1_HOLD</name>
              <description>TIMER 1 hold bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER2_HOLD</name>
              <description>TIMER 2 hold bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER3_HOLD</name>
              <description>TIMER 23 hold bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAN0_HOLD</name>
              <description>CAN0 hold bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C0_HOLD</name>
              <description>I2C0 hold bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1_HOLD</name>
              <description>I2C1 hold bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER4_HOLD</name>
              <description>TIMER4_HOLD</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER5_HOLD</name>
              <description>TIMER 5 hold bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER6_HOLD</name>
              <description>TIMER 6 hold bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAN1_HOLD</name>
              <description>CAN1 hold bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA0</name>
      <description>DMA controller</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA0_Channel0</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel1</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel2</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel3</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel4</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel5</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel6</name>
        <value>36</value>
      </interrupt>
      <registers>
        <register>
          <name>INTF</name>
          <displayName>INTF</displayName>
          <description>Interrupt flag register </description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GIF0</name>
              <description>Global interrupt flag of channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF0</name>
              <description>Full Transfer finish flag of channe 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF0</name>
              <description>Half transfer finish flag of channel 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIF0</name>
              <description>Error flag of channel 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF1</name>
              <description>Global interrupt flag of channel 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF1</name>
              <description>Full Transfer finish flag of channe 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF1</name>
              <description>Half transfer finish flag of channel 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIF1</name>
              <description>Error flag of channel 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF2</name>
              <description>Global interrupt flag of channel 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF2</name>
              <description>Full Transfer finish flag of channe 2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF2</name>
              <description>Half transfer finish flag of channel 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIF2</name>
              <description>Error flag of channel 2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF3</name>
              <description>Global interrupt flag of channel 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF3</name>
              <description>Full Transfer finish flag of channe 3</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF3</name>
              <description>Half transfer finish flag of channel 3</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIF3</name>
              <description>Error flag of channel 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF4</name>
              <description>Global interrupt flag of channel 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF4</name>
              <description>Full Transfer finish flag of channe 4</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF4</name>
              <description>Half transfer finish flag of channel 4</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIF4</name>
              <description>Error flag of channel 4</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF5</name>
              <description>Global interrupt flag of channel 5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF5</name>
              <description>Full Transfer finish flag of channe 5</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF5</name>
              <description>Half transfer finish flag of channel 5</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIF5</name>
              <description>Error flag of channel 5</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF6</name>
              <description>Global interrupt flag of channel 6</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF6</name>
              <description>Full Transfer finish flag of channe 6</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF6</name>
              <description>Half transfer finish flag of channel 6</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIF6</name>
              <description>Error flag of channel 6</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTC</name>
          <displayName>INTC</displayName>
          <description>Interrupt flag clear register </description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GIFC0</name>
              <description>Clear global interrupt flag of channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIFC0</name>
              <description>Clear bit for full transfer finish flag of channel 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIFC0</name>
              <description>Clear bit for half transfer finish flag of channel 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIFC0</name>
              <description>Clear bit for error flag of channel 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIFC1</name>
              <description>Clear global interrupt flag of channel 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIFC1</name>
              <description>Clear bit for full transfer finish flag of channel 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIFC1</name>
              <description>Clear bit for half transfer finish flag of channel 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIFC1</name>
              <description>Clear bit for error flag of channel 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIFC2</name>
              <description>Clear global interrupt flag of channel 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIFC2</name>
              <description>Clear bit for full transfer finish flag of channel 2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIFC2</name>
              <description>Clear bit for half transfer finish flag of channel 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIFC2</name>
              <description>Clear bit for error flag of channel 2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIFC3</name>
              <description>Clear global interrupt flag of channel 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIFC3</name>
              <description>Clear bit for full transfer finish flag of channel 3</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIFC3</name>
              <description>Clear bit for half transfer finish flag of channel 3</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIFC3</name>
              <description>Clear bit for error flag of channel 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIFC4</name>
              <description>Clear global interrupt flag of channel 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIFC4</name>
              <description>Clear bit for full transfer finish flag of channel 4</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIFC4</name>
              <description>Clear bit for half transfer finish flag of channel 4</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIFC4</name>
              <description>Clear bit for error flag of channel 4</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIFC5</name>
              <description>Clear global interrupt flag of channel 5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIFC5</name>
              <description>Clear bit for full transfer finish flag of channel 5</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIFC5</name>
              <description>Clear bit for half transfer finish flag of channel 5</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIFC5</name>
              <description>Clear bit for error flag of channel 5</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIFC6</name>
              <description>Clear global interrupt flag of channel 6</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIFC6</name>
              <description>Clear bit for full transfer finish flag of channel 6</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIFC6</name>
              <description>Clear bit for half transfer finish flag of channel 6</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIFC6</name>
              <description>Clear bit for error flag of channel 6</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0CTL</name>
          <displayName>CH0CTL</displayName>
          <description>Channel 0 control register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHEN</name>
              <description>Channel enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIE</name>
              <description>Enable bit for channel full transfer finish interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIE</name>
              <description>Enable bit for channel half transfer finish interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Enable bit for channel error interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>Transfer direction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMEN</name>
              <description>Circular mode enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PNAGA</name>
              <description>Next address generation algorithm of peripheral</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MNAGA</name>
              <description>Next address generation algorithm of memory</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWIDTH</name>
              <description>Transfer data size of peripheral</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWIDTH</name>
              <description>Transfer data size of memory</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PRIO</name>
              <description>Priority level</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>M2M</name>
              <description>Memory to Memory Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0CNT</name>
          <displayName>CH0CNT</displayName>
          <description>Channel 0 counter register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>Transfer counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0PADDR</name>
          <displayName>CH0PADDR</displayName>
          <description>Channel 0 peripheral base address register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PADDR</name>
              <description>Peripheral base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
